In [2]:
import pandas as pd
import datetime

In [2]:
def append_data(company_code, company_match, com_df):
    for key, val in company_code.items():
        filename = 'data/{}_{}.csv'.format('data', key)
        df_company = pd.read_csv(filename)
        df_company['date'] = df_company['date'].apply(lambda x : datetime.datetime.strptime(x, "%Y-%m-%d"))
        df_company.set_index('date', inplace=True)

        df_new = com_df[company_match[val]]
        df_new.set_index('date', inplace=True)     
        
    #     df_company.update(df_new, overwrite=False)
        df_company.update(df_new)
        df_company.reset_index(inplace=True)
        df_company.to_csv(filename, index=False)
    return df_company

In [7]:
date1 = datetime.datetime.strptime('2022-03-25', "%Y-%m-%d")
date1

datetime.datetime(2022, 3, 25, 0, 0)

In [9]:
dates = date1.strftime("%Y-%m-%d")

In [10]:
datetime.datetime.strptime(dates, "%Y-%m-%d")

datetime.datetime(2022, 3, 25, 0, 0)

In [61]:
dfo= pd.read_csv('data/d_o.csv', index_col=['a'])

In [57]:
dfn = pd.read_csv('data/d_n.csv')

In [66]:
dfo.reset_index(inplace=True)

In [67]:
dfo.head()

     a    b    c
0  1.0  4.0  NaN
1  NaN  NaN  3.0
2  2.0  NaN  NaN

In [47]:
dfn.head()

      a     b     c
0  11.0   NaN  33.0
1  12.0  23.0  34.0
2   NaN  24.0   NaN

In [33]:
dfo.update(dfn)

In [58]:
dfn.head(), dfo.head()

(      a     b     c
 0  11.0   NaN  33.0
 1  12.0  23.0  34.0
 2   NaN  24.0   NaN,
      a    b    c
 0  1.0  4.0  NaN
 1  NaN  NaN  3.0
 2  2.0  NaN  NaN)

In [59]:
dfn.update(dfo)

In [55]:
dfn.head()

      a     b     c
0  11.0   4.0  33.0
1  12.0  23.0  34.0
2   2.0  24.0   NaN

In [60]:
dfn.head()

      a     b     c
0   1.0   4.0  33.0
1  12.0  23.0   3.0
2   2.0  24.0   NaN

In [63]:
dfoc = dfo.copy()
dfoc.head()

       b    c
a
1.0  4.0  NaN
NaN  NaN  3.0
2.0  NaN  NaN